[
  {
    "image": "https://i.ibb.co.com/G474XnK9/download.jpg",
    "title": "Chatly - AI Messenger",
    "companyName": "NovaTech Labs",
    "id": 1,
    "description": "Chatly is an advanced AI-powered messaging platform designed to enhance communication, collaboration, and productivity. It integrates natural language processing, smart suggestions, and automated responses to make conversations seamless and efficient. Users can chat individually or in groups, share files, schedule meetings, and track project progress all within the app. Chatly provides end-to-end encryption to ensure privacy and security, while AI-driven analytics monitor engagement, highlight important messages, and summarize threads for faster decision-making. The app includes cross-device sync, custom themes, and intuitive notifications to ensure users never miss critical updates. Chatly’s AI assistant can draft responses, schedule reminders, and provide insights on conversation trends, making professional and personal communication faster and smarter. Designed for businesses, teams, and individuals, Chatly combines cutting-edge AI technology, robust security, and a user-friendly interface to deliver a professional-grade messaging experience that saves time, boosts efficiency, and strengthens connections across all interactions.",
    "size": 42,
    "reviews": 18340,
    "ratingAvg": 4.6,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 340 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 1290 },
      { "name": "4 star", "count": 3450 },
      { "name": "5 star", "count": 12840 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DD28D14M/demo-app-1.webp",
    "title": "TaskFlow",
    "companyName": "PixelSoft Studio",
    "id": 2,
    "description": "TaskFlow is a professional productivity application designed to organize tasks, manage projects, and boost personal and team efficiency. The app offers smart reminders, AI-generated suggestions, and prioritization tools to help users focus on critical activities while reducing distractions. Users can create to-do lists, set deadlines, track progress, and collaborate with team members in real-time. TaskFlow supports integration with calendars, cloud storage, and communication platforms to provide a seamless workflow experience. Advanced analytics allow users to monitor performance, identify bottlenecks, and optimize productivity patterns. The intuitive interface includes customizable dashboards, themes, and notifications that keep users on track and motivated. TaskFlow is suitable for individuals, small teams, and large organizations, offering a professional-grade solution for task management that merges intelligent automation, real-time collaboration, and actionable insights to help users achieve goals efficiently and consistently.",
    "size": 28,
    "reviews": 8230,
    "ratingAvg": 4.4,
    "downloads": 860000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 350 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 4670 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7JYPPvLH/demo-app-2.webp",
    "title": "FitTrack Pro",
    "companyName": "ActiveMind Inc.",
    "id": 3,
    "description": "FitTrack Pro is a comprehensive fitness and health tracking application designed to help users achieve their wellness goals with precision and motivation. The app monitors workouts, heart rate, calories burned, and activity levels while providing AI-generated personalized fitness plans. Users can set goals, track progress, and receive detailed performance insights to optimize training routines. FitTrack Pro integrates with wearables, smart scales, and nutrition trackers to deliver a holistic health perspective. Guided workouts, video tutorials, and challenge modes keep users engaged and motivated, while progress analytics allow adjustments for maximum effectiveness. The app also encourages community interaction through leaderboards, challenges, and support groups, fostering accountability and shared growth. FitTrack Pro combines advanced analytics, professional-grade monitoring tools, and a sleek interface to empower users to maintain healthy habits, improve performance, and achieve personal fitness objectives efficiently and sustainably.",
    "size": 55,
    "reviews": 12780,
    "ratingAvg": 4.7,
    "downloads": 2200000,
    "ratings": [
      { "name": "1 star", "count": 310 },
      { "name": "2 star", "count": 390 },
      { "name": "3 star", "count": 940 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 9630 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d4wF6Mt0/demo-app-3.webp",
    "title": "SnapPic Editor",
    "companyName": "Lensify Studios",
    "id": 4,
    "description": "SnapPic Editor is a professional-grade photo editing app designed to empower users with intuitive tools and AI-powered enhancements. It offers a variety of filters, effects, and one-touch enhancements that make editing simple and precise. Users can adjust brightness, contrast, saturation, and apply professional-level color correction to their images. SnapPic Editor includes advanced features such as background removal, AI-based portrait adjustments, and object recognition for easy editing. Integration with cloud storage, social media sharing, and batch editing allows for seamless workflow and creative expression. The app is optimized for both casual users and photographers, providing detailed editing capabilities while maintaining a user-friendly interface. SnapPic Editor combines technology, creativity, and professional-grade tools to deliver a comprehensive image editing experience that helps users achieve polished results quickly, creatively, and efficiently.",
    "size": 61,
    "reviews": 23210,
    "ratingAvg": 4.5,
    "downloads": 4100000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1020 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 6800 },
      { "name": "5 star", "count": 12090 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MkfWpRVm/demo-app-4.webp",
    "title": "NoteEase",
    "companyName": "Paperless Apps",
    "id": 5,
    "description": "NoteEase is a professional note-taking application designed to organize thoughts, ideas, and tasks efficiently. Users can create notes, categorize them with smart tags, and organize them into folders for easy retrieval. The app offers rich text formatting, multimedia support, and cross-device synchronization to ensure seamless access anytime, anywhere. AI-powered features include smart suggestions, automated summaries, and priority highlighting to improve productivity. Collaboration tools allow sharing notes with colleagues or friends, making team projects and planning effortless. Offline access ensures that important information is always available, and integrated search functions help users locate content quickly. NoteEase combines simplicity, intelligent organization, and professional-grade tools to provide a secure, reliable, and efficient platform for personal and professional note management, keeping information organized and actionable.",
    "size": 19,
    "reviews": 5210,
    "ratingAvg": 4.3,
    "downloads": 570000,
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 720 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 2240 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TqpcMzqw/demo-app-5.webp",
    "title": "TravelMate",
    "companyName": "WanderWorks",
    "id": 6,
    "description": "TravelMate is a comprehensive travel companion app designed to simplify planning, discovering, and enjoying trips. The app provides curated destination guides, itineraries, and local recommendations for accommodations, attractions, and dining. Users can book flights, hotels, and activities seamlessly, while AI-driven suggestions offer personalized travel options based on preferences, budget, and previous trips. TravelMate includes navigation tools, offline maps, and real-time alerts to optimize travel experiences and ensure safety. Social features allow users to share experiences, reviews, and photos with friends, enhancing engagement and discovery. TravelMate integrates travel tips, currency converters, language assistance, and local insights to create a professional, efficient, and enjoyable travel experience. Designed for solo travelers, families, and groups, the app combines technology, convenience, and intelligence to make every journey memorable and stress-free.",
    "size": 70,
    "reviews": 14600,
    "ratingAvg": 4.8,
    "downloads": 3300000,
    "ratings": [
      { "name": "1 star", "count": 290 },
      { "name": "2 star", "count": 330 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2900 },
      { "name": "5 star", "count": 10180 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rKLt7kLd/demo-app-6.webp",
    "title": "FinSmart",
    "companyName": "MoneyMind Ltd.",
    "id": 7,
    "description": "FinSmart is a professional finance management and budgeting app designed to help users gain full control over their personal and business finances. The platform tracks income, expenses, and investments while providing AI-generated insights for smarter money management. Users can set budgets, monitor spending patterns, and receive alerts for unusual transactions or approaching limits. FinSmart integrates bill reminders, recurring expense tracking, and financial goal planning to help users stay organized and informed. Secure data encryption ensures privacy and protection of sensitive information. With analytics dashboards, trend visualizations, and reports, users can make data-driven financial decisions with confidence. FinSmart empowers individuals and small businesses to optimize cash flow, increase savings, and make professional-grade financial decisions efficiently and effectively.",
    "size": 48,
    "reviews": 8900,
    "ratingAvg": 4.2,
    "downloads": 910000,
    "ratings": [
      { "name": "1 star", "count": 320 },
      { "name": "2 star", "count": 510 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 4370 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q3CwSvMG/learnX.jpg",
    "title": "LearnX",
    "companyName": "Eduverse Co.",
    "id": 8,
    "description": "LearnX is a professional e-learning platform designed to provide interactive, AI-enhanced courses and learning experiences. Users can access a wide range of subjects, from academic topics to professional skills, through video lessons, flashcards, and quizzes. The app features AI tutors that personalize learning paths, provide instant feedback, and adapt content to each user’s pace and ability. LearnX supports offline learning, progress tracking, and certification for completed courses. Community features allow learners to discuss concepts, collaborate on projects, and join virtual study groups. Advanced analytics help monitor performance, identify strengths and weaknesses, and optimize study strategies. With a sleek interface, intelligent content recommendations, and professional-grade learning tools, LearnX empowers students, professionals, and lifelong learners to acquire knowledge efficiently, stay motivated, and achieve their educational goals.",
    "size": 82,
    "reviews": 20300,
    "ratingAvg": 4.9,
    "downloads": 5400000,
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 290 },
      { "name": "3 star", "count": 720 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 16880 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wNkZJ0cC/download.jpg",
    "title": "Musicify",
    "companyName": "RhythmLab",
    "id": 9,
    "description": "Musicify is a professional music streaming and discovery platform that provides access to millions of tracks from artists worldwide. Users can create playlists, explore curated mixes, and discover new music tailored to their tastes using AI-driven recommendations. The app supports offline listening, high-quality audio streaming, and cross-device syncing for seamless music experiences. Musicify also features social sharing, collaborative playlists, and live event notifications to connect users with artists and music communities. Advanced search options, genre-specific radio stations, and mood-based playlists allow users to find music for any occasion. Designed for music enthusiasts, creators, and casual listeners, Musicify combines cutting-edge technology, intelligent recommendations, and an intuitive interface to deliver a professional-grade music platform that keeps users engaged, inspired, and entertained at all times.",
    "size": 64,
    "reviews": 25800,
    "ratingAvg": 4.7,
    "downloads": 7200000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 620 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 5400 },
      { "name": "5 star", "count": 17580 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tGSBNv5/icon.webp",
    "title": "MindSpace",
    "companyName": "CalmCore Studios",
    "id": 10,
    "description": "MindSpace is an advanced mental wellness and meditation platform designed to enhance focus, reduce stress, and improve overall cognitive performance. The app provides guided meditation sessions, relaxation exercises, breathing techniques, and sleep soundscapes tailored to the user’s goals and preferences. Leveraging AI algorithms, MindSpace recommends personalized routines based on mood tracking, cognitive patterns, and lifestyle data. The platform offers features such as progress tracking, habit building, and mindfulness reminders to integrate wellness practices into daily life effectively. Users can participate in community challenges, access expert-led workshops, and utilize immersive audio experiences that promote deep relaxation and mental clarity. MindSpace also includes detailed analytics to monitor stress levels, sleep quality, and mindfulness progress, empowering users to make informed adjustments for better mental health. With cross-device support, offline access, and an intuitive interface, MindSpace provides a professional-grade digital environment for mindfulness, self-improvement, and cognitive resilience, making it suitable for individuals seeking to optimize mental well-being in a fast-paced world.",
    "size": 53,
    "reviews": 15400,
    "ratingAvg": 4.8,
    "downloads": 2800000,
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 320 },
      { "name": "3 star", "count": 770 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1603791440384-56cd371ee9a7?w=400",
    "title": "CookMate",
    "companyName": "FlavorSync",
    "id": 11,
    "description": "CookMate is a smart culinary assistant app designed to streamline meal planning, recipe discovery, and kitchen management. Users can search thousands of recipes by ingredients, cuisine, dietary restrictions, or cooking time. CookMate provides AI-generated recipe suggestions based on user preferences, seasonal ingredients, and past cooking history. The app includes features like step-by-step guided cooking, voice instructions, and integrated timers for an optimized cooking experience. Users can generate grocery lists automatically, track pantry inventory, and plan weekly meals efficiently. Social features allow sharing recipes, following chefs, and collaborating with friends on cooking projects. CookMate also integrates nutrition information, meal recommendations, and portion control guidance to help users maintain healthy eating habits. Its professional-grade interface ensures an intuitive experience, while offline access allows cooking in kitchens without connectivity. By combining intelligent recommendations, organization tools, and culinary inspiration, CookMate empowers both amateur and professional chefs to explore, create, and enjoy meals with confidence and ease, making everyday cooking both practical and enjoyable.",
    "size": 77,
    "reviews": 8900,
    "ratingAvg": 4.5,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 270 },
      { "name": "2 star", "count": 350 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 5080 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1599305445671-ac291c95aaa9?w=400",
    "title": "BookNest",
    "companyName": "LitWorld Inc.",
    "id": 12,
    "description": "BookNest is an advanced eBook reading and library management app designed for avid readers and learning enthusiasts. The platform provides access to thousands of eBooks across genres, including fiction, non-fiction, academic texts, and professional resources. Users can track reading progress, annotate pages, highlight text, and manage collections efficiently. BookNest leverages AI recommendations to suggest new books based on reading history, ratings, and preferences, creating a personalized discovery experience. Integrated features include offline reading, cloud syncing across devices, audiobook support, and reading challenges to enhance engagement. Social features allow users to join book clubs, share insights, and participate in community discussions, fostering a vibrant literary community. BookNest also offers advanced search capabilities, reading statistics, and customizable reading settings for optimal user experience. Designed for students, professionals, and casual readers, the app combines cutting-edge technology, interactive features, and content diversity to deliver a professional-grade platform for discovering, enjoying, and managing digital reading in a seamless, personalized, and engaging manner.",
    "size": 95,
    "reviews": 11200,
    "ratingAvg": 4.6,
    "downloads": 2400000,
    "ratings": [
      { "name": "1 star", "count": 390 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 6730 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nszJbvbg/Shopy.png",
    "title": "Shoply",
    "companyName": "Trendify Global",
    "id": 13,
    "description": "Shoply is a professional-grade eCommerce and shopping assistant app built for modern consumers seeking convenience, deals, and seamless shopping experiences. Users can explore a vast catalog of products across categories, compare prices, and receive AI-powered recommendations tailored to preferences and shopping history. Shoply integrates secure payment gateways, one-click checkout, and order tracking, ensuring a smooth transaction experience. The app also highlights daily deals, flash sales, and exclusive promotions while enabling notifications for personalized offers. Advanced features include wishlist management, loyalty programs, and intelligent inventory alerts. Shoply’s intuitive interface, search filters, and smart sorting enhance product discovery and streamline the shopping journey. Social integration allows users to share purchases, reviews, and gift recommendations with friends and family. Designed for both casual shoppers and power users, Shoply leverages data analytics and AI-driven personalization to deliver an efficient, enjoyable, and professional shopping platform that keeps users informed, engaged, and satisfied.",
    "size": 58,
    "reviews": 19800,
    "ratingAvg": 4.4,
    "downloads": 4100000,
    "ratings": [
      { "name": "1 star", "count": 640 },
      { "name": "2 star", "count": 740 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 5100 },
      { "name": "5 star", "count": 11520 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/chwgS4B4/download.jpg",
    "title": "PetPal",
    "companyName": "FurFriends Co.",
    "id": 14,
    "description": "PetPal is a comprehensive pet care and management application designed for pet owners seeking convenience, insight, and peace of mind. The app allows users to track vaccinations, medical history, appointments, and daily activities such as feeding, walking, and grooming. PetPal provides AI-driven reminders for vaccinations, medications, and routine care tasks to ensure pets’ health is maintained consistently. Users can locate nearby veterinary clinics, pet-friendly services, and adoption centers. The platform also includes social features for connecting with other pet owners, sharing tips, and discovering community events. PetPal’s intuitive interface and cloud sync capabilities allow multiple pets and family members to coordinate care efficiently. By integrating smart analytics, educational resources, and health tracking, PetPal empowers pet owners to provide professional-grade care, enhance well-being, and strengthen the bond with their furry companions through a reliable and user-friendly digital environment.",
    "size": 63,
    "reviews": 7800,
    "ratingAvg": 4.3,
    "downloads": 970000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 380 },
      { "name": "3 star", "count": 980 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 3890 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1611162618071-b39a2ec055fb?w=400",
    "title": "QuickDoc",
    "companyName": "MediCare Tech",
    "id": 15,
    "description": "QuickDoc is a professional healthcare management app designed to streamline medical appointments, consultations, and digital prescriptions for users. The platform allows patients to book appointments with doctors, access telehealth services, and securely receive medical records. QuickDoc leverages AI to provide symptom checkers, personalized care suggestions, and reminders for follow-up visits and medications. Users can communicate with healthcare professionals via chat or video, review treatment plans, and store medical history for easy reference. The app also includes insurance management, lab report integration, and secure document storage to ensure comprehensive health management. Designed for patients and healthcare providers alike, QuickDoc enhances access, convenience, and efficiency, delivering a professional-grade digital healthcare experience that empowers users to manage wellness proactively, save time, and maintain accurate medical records with confidence and privacy.",
    "size": 71,
    "reviews": 13200,
    "ratingAvg": 4.7,
    "downloads": 2100000,
    "ratings": [
      { "name": "1 star", "count": 310 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 860 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 8830 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vCXNMb08/images.png",
    "title": "DriveSafe",
    "companyName": "AutoMind Systems",
    "id": 16,
    "description": "DriveSafe is an advanced driver assistance and vehicle monitoring application designed to enhance road safety and improve driving habits. The platform tracks driving behavior, including speed, braking, acceleration, and route patterns, providing real-time feedback and performance scoring. DriveSafe integrates AI-driven alerts for potential hazards, traffic updates, and road condition warnings to ensure informed decision-making while driving. Users can set personalized goals, track improvement over time, and earn safety rewards for consistent responsible behavior. The app also supports fleet management, vehicle maintenance reminders, and insurance integration for both personal and professional use. DriveSafe’s intuitive dashboard, analytics, and reporting enable users to visualize driving trends, identify risks, and adopt safer habits. By combining technology, analytics, and intelligent alerts, DriveSafe empowers drivers to reduce accidents, maintain vehicle health, and achieve a professional-grade driving safety experience that promotes confidence, awareness, and efficiency on the road.",
    "size": 80,
    "reviews": 6400,
    "ratingAvg": 4.1,
    "downloads": 750000,
    "ratings": [
      { "name": "1 star", "count": 320 },
      { "name": "2 star", "count": 440 },
      { "name": "3 star", "count": 980 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 2860 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZpZWM01p/download.jpg",
    "title": "Newsly",
    "companyName": "InfoStream Media",
    "id": 17,
    "description": "Newsly is a cutting-edge news and media platform designed to deliver personalized, real-time news updates and comprehensive coverage of global events. Users can access breaking news, in-depth articles, trending stories, and multimedia content across multiple categories including politics, technology, business, entertainment, and sports. Newsly’s AI-driven recommendation engine curates content based on user interests, reading history, and location, ensuring a highly personalized news experience. The app supports notifications for breaking events, offline reading, and cross-device synchronization. Users can save articles, share insights, and participate in discussions within a professional, moderated community. Newsly also offers multimedia features such as live streams, video reports, and interactive infographics to enhance content engagement. With a sleek, intuitive interface, advanced search capabilities, and a commitment to verified, credible sources, Newsly delivers a professional-grade news consumption experience that empowers users to stay informed, make decisions, and engage meaningfully with global developments.",
    "size": 46,
    "reviews": 17500,
    "ratingAvg": 4.5,
    "downloads": 3600000,
    "ratings": [
      { "name": "1 star", "count": 510 },
      { "name": "2 star", "count": 680 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 11110 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZ1SrcpF/download.jpg",
    "title": "Evently",
    "companyName": "PlanSmart Co.",
    "id": 18,
    "description": "Evently is a professional event discovery and management platform designed for individuals and organizations looking to find, plan, and manage events efficiently. Users can discover local concerts, workshops, conferences, sports events, and social gatherings based on location, interests, and calendar availability. Evently integrates ticketing, registration, and event reminders to streamline the planning process. The app leverages AI-driven suggestions to recommend events that match user preferences, social networks, and trending topics. Users can create personal schedules, share events with friends, and collaborate on group planning seamlessly. For organizers, Evently offers tools to manage attendees, track engagement, and analyze participation metrics. The platform also provides interactive maps, directions, and notifications for real-time updates and changes. With a professional-grade interface, intelligent analytics, and robust social integration, Evently delivers a comprehensive, user-friendly solution for discovering, attending, and organizing events with confidence, efficiency, and convenience.",
    "size": 67,
    "reviews": 9300,
    "ratingAvg": 4.6,
    "downloads": 1900000,
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 330 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 5560 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mrQ2mzHz/download.png",
    "title": "Weatherly",
    "companyName": "SkyTrack Systems",
    "id": 19,
    "description": "Weatherly is a professional-grade weather forecasting application providing real-time updates, AI-based predictions, and interactive meteorological data. The app delivers accurate forecasts, hourly updates, and long-term climate analysis for any location worldwide. Weatherly incorporates radar maps, severe weather alerts, and customizable notifications to help users plan activities safely and efficiently. Users can access detailed weather analytics including temperature trends, precipitation levels, wind patterns, and air quality indices. The platform leverages AI and machine learning to enhance prediction accuracy and provide personalized recommendations for outdoor activities, travel, and daily routines. Weatherly also offers offline mode, cross-device synchronization, and integration with calendars for optimized scheduling. Designed for both casual users and professionals such as farmers, pilots, and event planners, Weatherly combines advanced analytics, intuitive design, and reliable data sources to deliver a comprehensive, professional, and user-friendly weather management experience.",
    "size": 44,
    "reviews": 20200,
    "ratingAvg": 4.7,
    "downloads": 5200000,
    "ratings": [
      { "name": "1 star", "count": 340 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1050 },
      { "name": "4 star", "count": 2700 },
      { "name": "5 star", "count": 15630 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/3y0R1YMt/download.png",
    "title": "HomeHub",
    "companyName": "SmartNest IoT",
    "id": 20,
    "description": "HomeHub is a comprehensive smart home management platform designed to integrate and control IoT devices seamlessly for modern households. The app allows users to monitor energy consumption, automate lighting, HVAC, security systems, and entertainment devices from a single interface. HomeHub provides AI-driven insights to optimize energy efficiency, suggest automation routines, and enhance home security. Users can set schedules, create smart scenes, and receive real-time notifications about device status, intrusions, or environmental changes. The platform supports multiple users, voice control integration, and cross-device synchronization, ensuring that all household members can manage devices effortlessly. HomeHub also includes remote access, troubleshooting guides, and predictive maintenance alerts to maintain optimal performance of connected devices. With a professional-grade interface, robust analytics, and intelligent automation, HomeHub empowers homeowners to create a convenient, secure, and energy-efficient living environment, enhancing comfort, control, and smart home intelligence in everyday life.",
    "size": 92,
    "reviews": 12400,
    "ratingAvg": 4.4,
    "downloads": 1800000,
    "ratings": [
      { "name": "1 star", "count": 260 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 970 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 6250 }
    ]
  }

]
